/* 
2.Завдання "Позика"
Значення змінних:

n – сума кредиту;
y - кількість років, на які береться кредит;
p – відсоток, під який береться кредит;
m – щомісячна виплата за кредитом;
s – сумарна виплата.

Місячні виплати перебувають за формулою:

m = (n * p * (1 + p) y) / (12 * ((1 + p) y - 1)), де p виражається в частках одиниці, а не відсотках.

Сумарна виплата є виплатами за всі місяці кожного року:
s = (m * 12) * y

*/


#include <stdio.h>
#include <math.h>
int main() {
    
    double p, m, s;
    int n, y;

    printf("Задайте суму кредиту в грн:\n");
    scanf("%d", &n);
    printf("Задайте відсоток під який ви берете кредит в грн:\n");
    scanf("%lf", &p);
    printf("Задайте кількість років на який ви берете кредит:\n");
    scanf("%d", &y);


    p = p / 100;
    m = (n * p * pow((1+p),y)) / (12 * (pow(1+p,y) - 1));
    s = m * 12 * y;

    printf("Місячні виплата в грн: %.0lf\n", m);
    printf("Сумарна виплата за рік: %.0lf", s);

    return 0;
    
}




